{
    "nav.home": "Home",
    "nav.about": "Sobre Mim",
    "nav.projects": "Projetos",
    "nav.contact": "Contato",
    
    "hero.subtitle": "Gabriel R. Pires .",
    "hero.area": "Engenheiro da Computação",
    "hero.description": "Programador full stack em formação, com foco em desenvolvimento web e integração entre hardware e software utilizando Arduino, Raspberry Pi e microcontroladores.",
    "hero.button": "THINGS I'VE BUILT",
    
    "about.peek": "TAKE A PEEK",
    "about.title": "SOBRE MIM",
    "about.description": "Me chamo Gabriel e atualmente curso Engenharia da Computação. Sou apaixonado por tecnologia e gosto de transformar ideias em projetos reais. Trabalho com desenvolvimento web e também com eletrônica, explorando o uso de Arduino, Raspberry Pi e microcontroladores para criar soluções que unem software e hardware. Gosto de entender como as coisas funcionam por dentro e buscar maneiras criativas de melhorar sistemas e processos. Tenho curiosidade por novas tecnologias, segurança da informação e automação, áreas que me motivam a aprender continuamente. Atualmente, estou aprimorando minhas habilidades em HTML, CSS, JavaScript e frameworks modernos, com o objetivo de me tornar um desenvolvedor full stack completo. Acredito que o aprendizado é um processo constante, e busco sempre evoluir através de projetos práticos, desafios e colaboração com outras pessoas da área. Fora da programação, gosto de explorar ideias, testar conceitos e aprender sobre diferentes formas de aplicar a tecnologia para resolver problemas do dia a dia.",
    
    "projects.title": "MEUS PROJETOS",
    "projects.more": "Click for More",
    
    "contact.title": "FALE COMIGO",
    "contact.email_header": "E-mail",
    "contact.email_desc": "O jeito mais rápido de falar.",
    "contact.email_btn": "Enviar Email",
    "contact.linkedin_header": "LinkedIn",
    "contact.linkedin_desc": "Conexão profissional e carreira.",
    "contact.linkedin_btn": "Acessar Perfil",
    "contact.github_header": "GitHub",
    "contact.github_desc": "Veja meu código e projetos.",
    "contact.github_btn": "Ver Repositórios",
    
    "footer.copyright": "Copyright 2025 © All rights Reserved. Design by Gabriel Rezende Pires",
    
    "detail.back": "← VOLTAR PARA PROJETOS",
    "detail.overview": "Visão Geral do Projeto",
    "detail.challenges": "Desafios e Soluções",
    "detail.github": "VER CÓDIGO NO GITHUB",
    "detail.video": "VER VÍDEO DEMONSTRATIVO"
}